In [7]:
import mysql.connector
connection = mysql.connector.connect(
    user='root',
    password='mM.1aA2aA3zZ4$',
    host='localhost',
    database='PAI'
)
db = connection.cursor()

In [10]:
import pandas as pd
df = pd.read_csv("csv/review.csv")

In [6]:
db.execute("CREATE DATABASE PAI")

In [10]:
import pandas as pd
# df['price'] = pd.to_numeric(df['price'].str.replace('Rs.','').str.replace(',','').str.replace('-',''))
df['name'] = df['name'].str.replace('-','').str.replace('||','')
# df['score'] =pd.to_numeric(df['score'].str.replace('-',''))
# file_path = 'page.txt'
# with open(file_path, 'r') as file:
#     product_link = file.ALTER USER 'root'@'localhost' IDENTIFIED WITH mysql_native_password BY 'mM.1aA2aA3zZ4$';read().splitlines()
# product_link.pop()
# df['link'] = product_link
df.to_csv("new_data.csv" , index = False)

In [7]:
import random
num_rew = []
num_q = []
df1 = df['review']
for i in range(len(df1)):
    random_number = random.randint(0, 10)
    num_rew.append(len(df1[i].split('\n')))
    num_q.append(random_number)

In [16]:
df['num_of_rev'] = num_rew
df

                                                review  reviewID  num_of_rev
0    Muhammad B.\n1 day ago\n...\nRedmi ke Achi pro...         1          14
1    Zaheer H.\n4 months ago\n...\nThis is really a...         2          17
2    S***.\n5 days ago\n...\nMobile without mobile ...         3          17
3    Snake E.\n2 weeks ago\n...\nI got what was sho...         4          18
4    3***8\n3 months ago\n...\nAlhamdulillah same r...         5          17
..                                                 ...       ...         ...
194  Khalid H.\n3 weeks ago\n...\nI'm extremely sat...       196          22
195  Mehboob U.\n2 months ago\n...\noutstanding. sa...       197          18
196  Muhammad A.\n4 months ago\n...\nAoa Jaisa bola...       198          25
197                                                  -       199           1
198                                                  -       200           1

[199 rows x 3 columns]

In [4]:
df.to_csv("review.csv" , index = False)

In [11]:
from sqlalchemy import create_engine
engine = create_engine('mysql+pymysql://root:mM.1aA2aA3zZ4$@localhost/PAI')
df.to_sql(name='review', con=engine, if_exists='replace', index=False)

199

In [13]:
from sqlalchemy import create_engine

In [17]:
engine = create_engine('mysql+pymysql://root:mM.1aA2aA3zZ4$@localhost/PAI')
sql_query = "SELECT name FROM data_1"
filtered_df = pd.read_sql(sql_query, con=engine)

In [18]:
filtered_df

             name
0        Redmi12C
1     RedmiNote12
2      SamsungA14
3     InfinixNote
4        RedmiA2+
..            ...
194    InfinixHot
195  RealmeC51RAM
196  Xiaomi13TPro
197  samsangNote8
198  Infinixsmart

[199 rows x 1 columns]